import { arraySorting, arrayFiltering, arrayPushing } from './index';

describe('Урок 5.11 - Работа с массивами', () => {
  test('Тест парсинга и сортировки массива для данных "101,2,0,4,44"', () => {
    expect(arraySorting("101,2,0,4,44")).toBe("0,2,4,44,101");
  });

  test('Тест фильтрации массива для данных [101,12,220,340,4,44] - должны быть удалены все числа больше 100', () => {
    expect(arrayFiltering([101,12,220,340,4,44])).toStrictEqual([12,4,44]);
  });

  test('Тест на обход массива и добавление данных - объединение массивов [1,2,3,4,5] и [101,102,103,104,105]', () => {
    expect(arrayPushing([1,2,3,4,5], [101,102,103,104,105])).toStrictEqual([1,101,2,102,3,103,4,104,5,105]);
  });
});